# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\1_work\my_project\ReloadPro\psoc42boot\Reload Pro.cydsn\Reload Pro.cyprj
# Date: Sun, 13 Oct 2019 20:14:52 GMT
#set_units -time ns
create_clock -name {UART_Clock(FFB)} -period 723.95833333333326 -waveform {0 361.979166666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {ADC_intClock(FFB)} -period 583.33333333333326 -waveform {0 291.666666666667} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {Display_I2C_SCBCLK(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 35} -nominal_period 723.95833333333326 [list]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 27} -nominal_period 583.33333333333326 [list]
create_generated_clock -name {Display_I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 6001 12001} [list [get_pins {ClockBlock/udb_div_0}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\1_work\my_project\ReloadPro\psoc42boot\Reload Pro.cydsn\TopDesign\TopDesign.cysch
# Project: D:\1_work\my_project\ReloadPro\psoc42boot\Reload Pro.cydsn\Reload Pro.cyprj
# Date: Sun, 13 Oct 2019 20:14:47 GMT
