# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\1_work\my_project\ReloadPro\psoc42boot\Bootloader.cydsn\Bootloader.cyprj
# Date: Thu, 27 Jun 2019 17:21:37 GMT
#set_units -time ns
create_clock -name {UART_Clock(FFB)} -period 723.95833333333326 -waveform {0 361.979166666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 35} -nominal_period 723.95833333333326 [list]


# Component constraints for D:\1_work\my_project\ReloadPro\psoc42boot\Bootloader.cydsn\TopDesign\TopDesign.cysch
# Project: D:\1_work\my_project\ReloadPro\psoc42boot\Bootloader.cydsn\Bootloader.cyprj
# Date: Thu, 27 Jun 2019 17:21:33 GMT
